app/views/users/show.html.erb

	<li class="<%= 'active' if params[:tab].nil? %>">
		<%= link_to "Posts (#{@user.posts.size})", user_path(@user) %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]

	<li class="<%='active' if params[:tab] == 'comments'%>">
		<%= link_to "Comments (#{@user.comments.size})", user_path(@user, tab: 'comments') %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 5]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 5]]