app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 19 Apr 2019 06:26:12 UTC +00:00], ["name", "fdfff"], ["updated_at", Fri, 19 Apr 2019 06:26:12 UTC +00:00]]
---
	def create
		@category = Category.new(category_params)

		if @category.save