app/controllers/comments_controller.rb

	def create
		@comment = @post.comments.build(params.require(:comment).permit(:body))
		@comment.user = current_user

		if @comment.save
---
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "fdsffffdfsff"], ["created_at", Wed, 24 Apr 2019 09:51:45 UTC +00:00], ["post_id", 13], ["updated_at", Wed, 24 Apr 2019 09:51:45 UTC +00:00], ["user_id", 5]]