app/controllers/posts_controller.rb

  def index
  	@posts = Post.all.sort_by {|post| post.total_votes}.reverse
---
SELECT "posts".* FROM "posts"

  def create
  	@post = Post.new(post_params)
  	@post.user = current_user

  	if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 18 Apr 2019 10:52:38 UTC +00:00], ["description", "122"], ["title", "apple"], ["updated_at", Thu, 18 Apr 2019 10:52:38 UTC +00:00], ["url", "fdffdf"], ["user_id", 1]]

  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "new food"], ["updated_at", Thu, 18 Apr 2019 13:01:33 UTC +00:00]]

  def vote
    @vote = Vote.create(voteable: @post, user: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 25 Apr 2019 03:31:59 UTC +00:00], ["updated_at", Thu, 25 Apr 2019 03:31:59 UTC +00:00], ["user_id", 5], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]