app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)

		if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Tue, 23 Apr 2019 15:50:12 UTC +00:00], ["updated_at", Tue, 23 Apr 2019 15:50:12 UTC +00:00], ["username", "fdff"]]